ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/SYS_CODE/Head/LPC2200.inc
;****************************************CopyrightEQU  (c)************************************************
;**                         
;**
;**                               
;**
;**--------------File Info--------------------------------------------------------------------------------
;** File name:           LPC2294.inc
;** Last modified Date:  2012-12-31
;** Last Version:        1.0
;** Descriptions:        Defines the special registers and firmware programs for
;**                      lpc22xx\lpc212x\lpc211x\lpc210x
;**-------------------------------------------------------------------------------------------------------
;** Modified by:         
;** Modified date:       2012-12-31
;** Version:             1.0
;** Descriptions:        lpc22xx\lpc212x\lpc211x\lpc210x芯片的头文件
;**
;**-------------------------------------------------------------------------------------------------------
;** Modified by:
;** Modified date:
;** Version:
;** Descriptions:
;**
;********************************************************************************************************/
;/*******************************************************************************************************
;  EXTERNAL MEMORY CONTROLLER (EMC)
;  外部总线控制器
;********************************************************************************************************/

BCFG0           EQU 0xFFE00000                                          ;  lpc22xx only 
BCFG1           EQU 0xFFE00004                                          ;  lpc22xx only 
BCFG2           EQU 0xFFE00008                                          ;  lpc22xx only 
BCFG3           EQU 0xFFE0000C                                          ;  lpc22xx only 

;/********************************************************************************************************
;;  External Interrupts
;;  外部中断控制寄存器
;********************************************************************************************************/

EXTINT          EQU 0xE01FC140
EXTWAKE         EQU 0xE01FC144
EXTMODE         EQU 0xE01FC148                                          ;  Not used for lpc210x
EXTPOLAR        EQU 0xE01FC14C                                          ;  Not used for lpc210x

;/********************************************************************************************************
;  SMemory mapping control.
;  内存remap控制寄存器
;********************************************************************************************************/

MEMMAP          EQU 0xE01FC040

;/********************************************************************************************************
;  Phase Locked Loop (PLL)
;  PLL控制寄存器
;********************************************************************************************************/

PLLCON          EQU 0xE01FC080
PLLCFG          EQU 0xE01FC084
PLLSTAT         EQU 0xE01FC088
PLLFEED         EQU 0xE01FC08C

;/********************************************************************************************************
;  Power Control
;  功率控制寄存器
;********************************************************************************************************/

PCON            EQU 0xE01FC0C0
PCONP           EQU 0xE01FC0C4

;/********************************************************************************************************
;  VPB Divider
;  VLSI外设总线（VPB）分频寄存器
;********************************************************************************************************/

VPBDIV          EQU 0xE01FC100

;/********************************************************************************************************
;  Memory Accelerator Module (MAM)
;  存储器加速模块
;********************************************************************************************************/

MAMCR           EQU 0xE01FC000
MAMTIM          EQU 0xE01FC004

;/********************************************************************************************************
;  Vectored Interrupt Controller (VIC)
;  向量中断控制器(VIC)的特殊寄存器
;********************************************************************************************************/

VICIRQStatus    EQU 0xFFFFF000
VICFIQStatus    EQU 0xFFFFF004
VICRawIntr      EQU 0xFFFFF008
VICIntSelect    EQU 0xFFFFF00C
VICIntEnable    EQU 0xFFFFF010
VICIntEnClr     EQU 0xFFFFF014
VICSoftInt      EQU 0xFFFFF018
VICSoftIntClear EQU 0xFFFFF01C
VICProtection   EQU 0xFFFFF020
VICVectAddr     EQU 0xFFFFF030
VICDefVectAddr  EQU 0xFFFFF034
VICVectAddr0    EQU 0xFFFFF100
VICVectAddr1    EQU 0xFFFFF104
VICVectAddr2    EQU 0xFFFFF108
VICVectAddr3    EQU 0xFFFFF10C
VICVectAddr4    EQU 0xFFFFF110
VICVectAddr5    EQU 0xFFFFF114
VICVectAddr6    EQU 0xFFFFF118
VICVectAddr7    EQU 0xFFFFF11C
VICVectAddr8    EQU 0xFFFFF120
VICVectAddr9    EQU 0xFFFFF124
VICVectAddr10   EQU 0xFFFFF128
VICVectAddr11   EQU 0xFFFFF12C
VICVectAddr12   EQU 0xFFFFF130
VICVectAddr13   EQU 0xFFFFF134
VICVectAddr14   EQU 0xFFFFF138
VICVectAddr15   EQU 0xFFFFF13C
VICVectCntl0    EQU 0xFFFFF200
VICVectCntl1    EQU 0xFFFFF204
VICVectCntl2    EQU 0xFFFFF208
VICVectCntl3    EQU 0xFFFFF20C
VICVectCntl4    EQU 0xFFFFF210
VICVectCntl5    EQU 0xFFFFF214
VICVectCntl6    EQU 0xFFFFF218
VICVectCntl7    EQU 0xFFFFF21C
VICVectCntl8    EQU 0xFFFFF220
VICVectCntl9    EQU 0xFFFFF224
VICVectCntl10   EQU 0xFFFFF228
VICVectCntl11   EQU 0xFFFFF22C
VICVectCntl12   EQU 0xFFFFF230
VICVectCntl13   EQU 0xFFFFF234
VICVectCntl14   EQU 0xFFFFF238
VICVectCntl15   EQU 0xFFFFF23C

;/********************************************************************************************************
;  Pin Connect Block
;  管脚连接模块控制寄存器
;********************************************************************************************************/

PINSEL0         EQU 0xE002C000
PINSEL1         EQU 0xE002C004
PINSEL2         EQU 0xE002C014                                          ;  Not used for lpc210x

;/********************************************************************************************************
;  General Purpose Input/Output (GPIO)
;  通用并行IO口的特殊寄存器
;********************************************************************************************************/

IOPIN           EQU 0xE0028000                                          ;  lpc210x only 
IOSET           EQU 0xE0028004                                          ;  lpc210x only 
IODIR           EQU 0xE0028008                                          ;  lpc210x only 
IOCLR           EQU 0xE002800C                                          ;  lpc210x only 

IO0PIN          EQU 0xE0028000                                          ;  Not used for lpc210x
IO0SET          EQU 0xE0028004                                          ;  Not used for lpc210x
IO0DIR          EQU 0xE0028008                                          ;  Not used for lpc210x
IO0CLR          EQU 0xE002800C                                          ;  Not used for lpc210x

IO1PIN          EQU 0xE0028010                                          ;  Not used for lpc210x
IO1SET          EQU 0xE0028014                                          ;  Not used for lpc210x
IO1DIR          EQU 0xE0028018                                          ;  Not used for lpc210x
IO1CLR          EQU 0xE002801C                                          ;  Not used for lpc210x

IO2PIN          EQU 0xE0028020                                          ;  lpc22xx only 
IO2SET          EQU 0xE0028024                                          ;  lpc22xx only 
IO2DIR          EQU 0xE0028028                                          ;  lpc22xx only 
IO2CLR          EQU 0xE002802C                                          ;  lpc22xx only 

IO3PIN          EQU 0xE0028030                                          ;  lpc22xx only 
IO3SET          EQU 0xE0028034                                          ;  lpc22xx only 
IO3DIR          EQU 0xE0028038                                          ;  lpc22xx only 
IO3CLR          EQU 0xE002803C                                          ;  lpc22xx only 

;/********************************************************************************************************
;  Universal Asynchronous Receiver Transmitter 0 (UART0)
;  通用异步串行口0(UART0)的特殊寄存器
;********************************************************************************************************/

