ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/SYS_CODE/Head/LPC2200.inc
U0RBR           EQU 0xE000C000
U0THR           EQU 0xE000C000
U0IER           EQU 0xE000C004
U0IIR           EQU 0xE000C008
U0FCR           EQU 0xE000C008
U0LCR           EQU 0xE000C00C
U0LSR           EQU 0xE000C014
U0SCR           EQU 0xE000C01C
U0DLL           EQU 0xE000C000
U0DLM           EQU 0xE000C004

;/********************************************************************************************************
;  Universal Asynchronous Receiver Transmitter 1 (UART1)
;  通用异步串行口1(UART1)的特殊寄存器
;********************************************************************************************************/

U1RBR           EQU 0xE0010000
U1THR           EQU 0xE0010000
U1IER           EQU 0xE0010004
U1IIR           EQU 0xE0010008
U1FCR           EQU 0xE0010008
U1LCR           EQU 0xE001000C
U1MCR           EQU 0xE0010010
U1LSR           EQU 0xE0010014
U1MSR           EQU 0xE0010018
U1SCR           EQU 0xE001001C
U1DLL           EQU 0xE0010000
U1DLM           EQU 0xE0010004

;/********************************************************************************************************
;  I2C (8/16 bit data bus)
;  芯片间总线（I2C）的特殊寄存器
;********************************************************************************************************/

I2CONSET        EQU 0xE001C000
I2STAT          EQU 0xE001C004
I2DAT           EQU 0xE001C008
I2ADR           EQU 0xE001C00C
I2SCLH          EQU 0xE001C010
I2SCLL          EQU 0xE001C014
I2CONCLR        EQU 0xE001C018

;/********************************************************************************************************
;  SPI (Serial Peripheral Interface)
;  SPI总线接口的特殊寄存器
        ;  only for lpc210x
;********************************************************************************************************/

SPI_SPCR        EQU 0xE0020000
SPI_SPSR        EQU 0xE0020004
SPI_SPDR        EQU 0xE0020008
SPI_SPCCR       EQU 0xE002000C
SPI_SPINT       EQU 0xE002001C

S0PCR           EQU 0xE0020000                                          ;  Not used for lpc210x
S0PSR           EQU 0xE0020004                                          ;  Not used for lpc210x
S0PDR           EQU 0xE0020008                                          ;  Not used for lpc210x
S0PCCR          EQU 0xE002000C                                          ;  Not used for lpc210x
S0PINT          EQU 0xE002001C                                          ;  Not used for lpc210x

S1PCR           EQU 0xE0030000                                          ;  Not used for lpc210x
S1PSR           EQU 0xE0030004                                          ;  Not used for lpc210x
S1PDR           EQU 0xE0030008                                          ;  Not used for lpc210x
S1PCCR          EQU 0xE003000C                                          ;  Not used for lpc210x
S1PINT          EQU 0xE003001C                                          ;  Not used for lpc210x

;/********************************************************************************************************
;  CAN CONTROLLERS AND ACCEPTANCE FILTER
;  CAN控制器和接收路波器
;  lpc2119\lpc2129\lpc2292\lpc2294 only
;********************************************************************************************************/

CAN1MOD         EQU 0xE0044000                                          
CAN1CMR         EQU 0xE0044004                                          
CAN1GSR         EQU 0xE0044008                                          
CAN1ICR         EQU 0xE004400C                                          
CAN1IER         EQU 0xE0044010                                          
CAN1BTR         EQU 0xE0044014                                          
CAN1EWL         EQU 0xE004401C                                          
CAN1SR          EQU 0xE0044020                                          
CAN1RFS         EQU 0xE0044024                                          
CAN1RDA         EQU 0xE0044028                                          
CAN1RDB         EQU 0xE004402C                                          
CAN1TFI1        EQU 0xE0044030                                          
CAN1TID1        EQU 0xE0044034                                          
CAN1TDA1        EQU 0xE0044038                                          
CAN1TDB1        EQU 0xE004403C                                          
CAN1TFI2        EQU 0xE0044040                                          
CAN1TID2        EQU 0xE0044044                                          
CAN1TDA2        EQU 0xE0044048                                          
CAN1TDB2        EQU 0xE004404C                                          
CAN1TFI3        EQU 0xE0044050                                          
CAN1TID3        EQU 0xE0044054                                          
CAN1TDA3        EQU 0xE0044058                                          
CAN1TDB3        EQU 0xE004405C                                          

CAN2MOD         EQU 0xE0048000                                          
CAN2CMR         EQU 0xE0048004                                          
CAN2GSR         EQU 0xE0048008                                          
CAN2ICR         EQU 0xE004800C                                          
CAN2IER         EQU 0xE0048010                                          
CAN2BTR         EQU 0xE0048014                                          
CAN2EWL         EQU 0xE004801C                                          
CAN2SR          EQU 0xE0048020                                          
CAN2RFS         EQU 0xE0048024                                          
CAN2RDA         EQU 0xE0048028                                          
CAN2RDB         EQU 0xE004802C                                          
CAN2TFI1        EQU 0xE0048030                                          
CAN2TID1        EQU 0xE0048034                                          
CAN2TDA1        EQU 0xE0048038                                          
CAN2TDB1        EQU 0xE004803C                                          
CAN2TFI2        EQU 0xE0048040                                          
CAN2TID2        EQU 0xE0048044                                          
CAN2TDA2        EQU 0xE0048048                                          
CAN2TDB2        EQU 0xE004804C                                          
CAN2TFI3        EQU 0xE0048050                                          
CAN2TID3        EQU 0xE0048054                                          
CAN2TDA3        EQU 0xE0048058                                          
CAN2TDB3        EQU 0xE004805C                                          

