ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/SYS_CODE/Head/LPC2200.inc
CAN3MOD         EQU 0xE004C000                                          
CAN3CMR         EQU 0xE004C004                                          
CAN3GSR         EQU 0xE004C008                                          
CAN3ICR         EQU 0xE004C00C                                          
CAN3IER         EQU 0xE004C010                                          
CAN3BTR         EQU 0xE004C014                                          
CAN3EWL         EQU 0xE004C01C                                          
CAN3SR          EQU 0xE004C020                                          
CAN3RFS         EQU 0xE004C024                                          
CAN3RDA         EQU 0xE004C028                                          
CAN3RDB         EQU 0xE004C02C                                          
CAN3TFI1        EQU 0xE004C030                                          
CAN3TID1        EQU 0xE004C034                                          
CAN3TDA1        EQU 0xE004C038                                          
CAN3TDB1        EQU 0xE004C03C                                          
CAN3TFI2        EQU 0xE004C040                                          
CAN3TID2        EQU 0xE004C044                                          
CAN3TDA2        EQU 0xE004C048                                          
CAN3TDB2        EQU 0xE004C04C                                          
CAN3TFI3        EQU 0xE004C050                                          
CAN3TID3        EQU 0xE004C054                                          
CAN3TDA3        EQU 0xE004C058                                          
CAN3TDB3        EQU 0xE004C05C                                          

CAN4MOD         EQU 0xE0050000                                          
CAN4CMR         EQU 0xE0050004                                          
CAN4GSR         EQU 0xE0050008                                          
CAN4ICR         EQU 0xE005000C                                          
CAN4IER         EQU 0xE0050010                                          
CAN4BTR         EQU 0xE0050014                                          
CAN4EWL         EQU 0xE005001C                                          
CAN4SR          EQU 0xE0050020                                          
CAN4RFS         EQU 0xE0050024                                          
CAN4RDA         EQU 0xE0050028                                          
CAN4RDB         EQU 0xE005002C                                          
CAN4TFI1        EQU 0xE0050030                                          
CAN4TID1        EQU 0xE0050034                                          
CAN4TDA1        EQU 0xE0050038                                          
CAN4TDB1        EQU 0xE005003C                                          
CAN4TFI2        EQU 0xE0050040                                          
CAN4TID2        EQU 0xE0050044                                          
CAN4TDA2        EQU 0xE0050048                                          
CAN4TDB2        EQU 0xE005004C                                          
CAN4TFI3        EQU 0xE0050050                                          
CAN4TID3        EQU 0xE0050054                                          
CAN4TDA3        EQU 0xE0050058                                          
CAN4TDB3        EQU 0xE005005C                                          

CAN5MOD         EQU 0xE0054000                                          
CAN5CMR         EQU 0xE0054004                                          
CAN5GSR         EQU 0xE0054008                                          
CAN5ICR         EQU 0xE005400C                                          
CAN5IER         EQU 0xE0054010                                          
CAN5BTR         EQU 0xE0054014                                          
CAN5EWL         EQU 0xE005401C                                          
CAN5SR          EQU 0xE0054020                                          
CAN5RFS         EQU 0xE0054024                                          
CAN5RDA         EQU 0xE0054028                                          
CAN5RDB         EQU 0xE005402C                                          
CAN5TFI1        EQU 0xE0054030                                          
CAN5TID1        EQU 0xE0054034                                          
CAN5TDA1        EQU 0xE0054038                                          
CAN5TDB1        EQU 0xE005403C                                          
CAN5TFI2        EQU 0xE0054040                                          
CAN5TID2        EQU 0xE0054044                                          
CAN5TDA2        EQU 0xE0054048                                          
CAN5TDB2        EQU 0xE005404C                                          
CAN5TFI3        EQU 0xE0054050                                          
CAN5TID3        EQU 0xE0054054                                          
CAN5TDA3        EQU 0xE0054058                                          
CAN5TDB3        EQU 0xE005405C                                          

CAN6MOD         EQU 0xE0058000                                          ;  lpc2292\lpc2294 only
CAN6CMR         EQU 0xE0058004                                          ;  lpc2292\lpc2294 only
CAN6GSR         EQU 0xE0058008                                          ;  lpc2292\lpc2294 only
CAN6ICR         EQU 0xE005800C                                          ;  lpc2292\lpc2294 only
CAN6IER         EQU 0xE0058010                                          ;  lpc2292\lpc2294 only
CAN6BTR         EQU 0xE0058014                                          ;  lpc2292\lpc2294 only
CAN6EWL         EQU 0xE005801C                                          ;  lpc2292\lpc2294 only
CAN6SR          EQU 0xE0058020                                          ;  lpc2292\lpc2294 only
CAN6RFS         EQU 0xE0058024                                          ;  lpc2292\lpc2294 only
CAN6RDA         EQU 0xE0058028                                          ;  lpc2292\lpc2294 only
CAN6RDB         EQU 0xE005802C                                          ;  lpc2292\lpc2294 only
CAN6TFI1        EQU 0xE0058030                                          ;  lpc2292\lpc2294 only
CAN6TID1        EQU 0xE0058034                                          ;  lpc2292\lpc2294 only
CAN6TDA1        EQU 0xE0058038                                          ;  lpc2292\lpc2294 only
CAN6TDB1        EQU 0xE005803C                                          ;  lpc2292\lpc2294 only
CAN6TFI2        EQU 0xE0058040                                          ;  lpc2292\lpc2294 only
CAN6TID2        EQU 0xE0058044                                          ;  lpc2292\lpc2294 only
CAN6TDA2        EQU 0xE0058048                                          ;  lpc2292\lpc2294 only
CAN6TDB2        EQU 0xE005804C                                          ;  lpc2292\lpc2294 only
CAN6TFI3        EQU 0xE0058050                                          ;  lpc2292\lpc2294 only
CAN6TID3        EQU 0xE0058054                                          ;  lpc2292\lpc2294 only
CAN6TDA3        EQU 0xE0058058                                          ;  lpc2292\lpc2294 only
CAN6TDB3        EQU 0xE005805C                                          ;  lpc2292\lpc2294 only 

