ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/SYS_CODE/Head/LPC2200.inc
CANTxSR         EQU 0xE0040000                                          
CANRxSR         EQU 0xE0040004                                          
CANMSR          EQU 0xE0040008                                          

CANAFMR         EQU 0xE003C000                                          
CANSFF_sa       EQU 0xE003C004                                          
CANSFF_GRP_sa   EQU 0xE003C008                                          
CANEFF_sa       EQU 0xE003C00C                                          
CANEFF_GRP_sa   EQU 0xE003C010                                          
CANENDofTable   EQU 0xE003C014                                          
CANLUTerrAd     EQU 0xE003C018                                          
CANLUTerr       EQU 0xE003C01C                                          
                                  
CANAFRAM        EQU 0xE0038000                                          ;  CAN Acceptance Filter RAM 

;/********************************************************************************************************
;  Timer 0
;  定时器0的特殊寄存器
;********************************************************************************************************/

T0IR            EQU 0xE0004000
T0TCR           EQU 0xE0004004
T0TC            EQU 0xE0004008
T0PR            EQU 0xE000400C
T0PC            EQU 0xE0004010
T0MCR           EQU 0xE0004014
T0MR0           EQU 0xE0004018
T0MR1           EQU 0xE000401C
T0MR2           EQU 0xE0004020
T0MR3           EQU 0xE0004024
T0CCR           EQU 0xE0004028
T0CR0           EQU 0xE000402C
T0CR1           EQU 0xE0004030
T0CR2           EQU 0xE0004034
T0CR3           EQU 0xE0004038
T0EMR           EQU 0xE000403C

;/********************************************************************************************************
;  Timer 1
;  定时器1的特殊寄存器
;********************************************************************************************************/

T1IR            EQU 0xE0008000
T1TCR           EQU 0xE0008004
T1TC            EQU 0xE0008008
T1PR            EQU 0xE000800C
T1PC            EQU 0xE0008010
T1MCR           EQU 0xE0008014
T1MR0           EQU 0xE0008018
T1MR1           EQU 0xE000801C
T1MR2           EQU 0xE0008020
T1MR3           EQU 0xE0008024
T1CCR           EQU 0xE0008028
T1CR0           EQU 0xE000802C
T1CR1           EQU 0xE0008030
T1CR2           EQU 0xE0008034
T1CR3           EQU 0xE0008038
T1EMR           EQU 0xE000803C

;/********************************************************************************************************
;  Pulse Width Modulator (PWM)
;  脉宽调制器的特殊寄存器
;********************************************************************************************************/

PWMIR           EQU 0xE0014000
PWMTCR          EQU 0xE0014004
PWMTC           EQU 0xE0014008
PWMPR           EQU 0xE001400C
PWMPC           EQU 0xE0014010
PWMMCR          EQU 0xE0014014
PWMMR0          EQU 0xE0014018
PWMMR1          EQU 0xE001401C
PWMMR2          EQU 0xE0014020
PWMMR3          EQU 0xE0014024
PWMMR4          EQU 0xE0014040
PWMMR5          EQU 0xE0014044
PWMMR6          EQU 0xE0014048
PWMPCR          EQU 0xE001404C
PWMLER          EQU 0xE0014050

;/********************************************************************************************************
;  A/D CONVERTER
;  A/D转换器
;********************************************************************************************************/

ADCR            EQU 0xE0034000                                          ;  Not used for lpc210x
ADDR            EQU 0xE0034004                                          ;  Not used for lpc210x

;/********************************************************************************************************
;  Real Time Clock
;  实时时钟的特殊寄存器
;********************************************************************************************************/

ILR             EQU 0xE0024000
CTC             EQU 0xE0024004
CCR             EQU 0xE0024008
CIIR            EQU 0xE002400C
AMR             EQU 0xE0024010
CTIME0          EQU 0xE0024014
CTIME1          EQU 0xE0024018
CTIME2          EQU 0xE002401C
SEC             EQU 0xE0024020
MIN             EQU 0xE0024024
HOUR            EQU 0xE0024028
DOM             EQU 0xE002402C
DOW             EQU 0xE0024030
DOY             EQU 0xE0024034
MONTH           EQU 0xE0024038
YEAR            EQU 0xE002403C
ALSEC           EQU 0xE0024060
ALMIN           EQU 0xE0024064
ALHOUR          EQU 0xE0024068
ALDOM           EQU 0xE002406C
ALDOW           EQU 0xE0024070
ALDOY           EQU 0xE0024074
ALMON           EQU 0xE0024078
ALYEAR          EQU 0xE002407C
PREINT          EQU 0xE0024080
PREFRAC         EQU 0xE0024084

;/********************************************************************************************************
;  Watchdog
;  看门狗的特殊寄存器
;********************************************************************************************************/

WDMOD           EQU 0xE0000000
WDTC            EQU 0xE0000004
WDFEED          EQU 0xE0000008
WDTV            EQU 0xE000000C

;/********************************************************************************************************
;  Define firmware Functions
;  定义固件函数
;********************************************************************************************************/
rm_init_entry             EQU  0x7fffff91
rm_undef_handler          EQU  0x7fffffa0
rm_prefetchabort_handler  EQU  0x7fffffb0
rm_dataabort_handler      EQU  0x7fffffc0
rm_irqhandler             EQU  0x7fffffd0
rm_irqhandler2            EQU  0x7fffffe0
iap_entry                 EQU  0x7ffffff1

;/********************************************************************************************************
;  End File
;********************************************************************************************************/
 END
